package shuhai.readercore.bean;

import java.util.List;

/**
 * @author 55345364
 * @date 2017/7/12.
 */

public class BookChapter {


    /**
     * code : 0000
     * message : [{"chapterid":"2642856","chapterorder":"7","chaptername":"第5章 第五章 心有猛虎待觉醒","saleprice":"0","size_c":"2982","jsfree":"0","paytype":"0","content":"    是否愿意，这不是李旭一时之间能够给出答案的，因为他非常清楚，一旦点头，那么他的生活就会发生翻天覆地的变化，而且这种变化，还带着极高的危险性。\r\n\r\n    老白的接/班人！\r\n\r\n    以老白在汉城的势力，一旦这件事情被落实，将会有无数双眼睛盯着李旭。\r\n\r\n    他们或许会见证李旭的撅起，或许，仅仅是在等待一个笑话而已。\r\n\r\n    李旭不敢直面这个问题，所以他需要一些时间来考虑。\r\n\r\n    当然，不可否认的是，这的确是一个机会，只可惜，这个机会实在是太大了，大到李旭有些把握不住。\r\n\r\n    \u201c跟女人打交道，不光是在床上把她们伺候舒服就行了，得留个心眼，谁也不知道她们什么时候会算计你。\u201d\r\n\r\n    一尾小指大小的麻鱼上钩，老白也不嫌弃，直接收入鱼护。\r\n\r\n    刘琴会不会害李旭，李旭清楚得很，当然，李旭也承认刘琴的确是个城府很深的女人。\r\n\r\n    就拿给陈刚那百分之二十的家产来说，那么大的集团，刘琴不可能拿不出这笔钱，半年百分之五，也就是想控制陈刚而已，让陈刚不敢闹事，不敢给她找麻烦，李旭心知肚明，既然他能够想到，老白这种老/江湖，自然也能够看透。\r\n\r\n    \u201c老白，说个实话，你为什么会愿意帮我？以你这样高高在上的人物，怎么可能看得起我这种小角色呢？\u201d\r\n\r\n    李旭本身是不愿意直面这个问题的，可是事实就是如此，他不面对也逃避不了，而且还心存疑惑，还不如干脆就寻个答案。\r\n\r\n    \u201c我有很多朋友，只可惜，这些朋友都是基于利益关系，我白爷的名号什么时候日落西山了，这些所谓的朋友，便不会再围绕在我身边，还记得我们第一次见面的时候吗？\u201d\r\n\r\n    \u201c你一个老男人，我记得这么清干什么？\u201d\r\n\r\n    李旭一点印象都没有了，整天和女人打交道，讨她们开心，李旭的脑子都用在想新奇花样上了，哪有容量记住和老白第一次见面。\r\n\r\n    白爷一脸苦笑，真是拿李旭一点办法都没有，要是其他人，敢用这种口气跟他说话，早就尸沉汉林河了，可奇怪的是，他倒喜欢李旭用这种语气跟他说话，舒服，自在。\r\n\r\n    \u201c那时候，你还在吃泡面，哭，满脸的鼻涕口水，你说你要在这个城市混出个人样，你说要让那些看不起你的人高攀不上，你跟我借了支烟，说你飞黄腾达的时候，要还我一支中华。\u201d\r\n\r\n    白爷回忆着往事，脸上露着淡淡的笑意。\r\n\r\n    听完这番话之后，李旭惊讶的望着白爷，那一天，他永远都不会忘记，因为他被扫地出门，失去了唯一的工作，没了人生的目标，也正是在那个时候，他认识了刘琴，刘琴给了他重生的机会。\r\n\r\n    这支烟，李旭一直记得，但他却忘了，那天给他烟的人，竟然是白爷。\r\n\r\n    或许\u2026\u2026真是哭得太厉害，以至于他当天根本就没有看清白爷的样子。\r\n\r\n    \u201c你需要形容得这么仔细吗？还满脸鼻涕口水，有没有这么夸张。\u201d\r\n\r\n    这事是李旭心里的一个烙印，他从来没忘，也从来不敢忘，即便是现在的生活已经好了很多，可那支烟，他没抽，一直放在家里，那就像是一件圣物，时刻的提醒着他当日落寞的情形。\r\n\r\n    \u201c我的烟呢？\u201d\r\n\r\n    老白抛竿而出，姿势优美，可鱼线直接扔在了杂草上。\r\n\r\n    \u201c老白，做人不能这么没良心啊，我每次来这里，看到你可都给了烟的，早还清了吧。\u201d\r\n\r\n    \u201c利群怎么能算，当初说好了可是中华啊。\u201d\r\n\r\n    两人表面上看着像是为了一支烟较劲，可实际上，两人的心里都清楚，他们是在为了李旭的身份地位而争论。\r\n\r\n    那支中华烟，就代表了李旭的身份。\r\n\r\n    如果在这个时候，李旭还了一支中华，那么他便不再和白爷有任何交集的可能性，当他满于现状，白爷的存在也就没有任何意义了，而且白爷也不会对他有任何的期望。\r\n\r\n    李旭满足了吗？\r\n\r\n    并没有，他还需要一些时间，利群只是喜好，而中华，才是目标。\r\n\r\n    \u201c老白，你慢慢钓，我还有事，就不陪你了。\u201d\r\n\r\n    说完，李旭没等老白回答，直接就走了，他需要一点空间冷静一下，让自己彻头彻尾的想想生活究竟该以什么样的方式继续下去。\r\n\r\n    \u201c白爷，你为什么会那么看重这个年轻人？\u201d\r\n\r\n    说话的人，是白爷的心腹，在汉城也是个响当当的人物，人称白骨，没有人知道他的真实姓名，传说这是个猛将，当年白爷打天下的时候，他是白爷手下的头号打手，不过这些年已经渐渐收手，所以年轻一代知道他的并不多。\r\n\r\n    \u201c心有猛虎待觉醒，是个值得期待的苗子。\u201d\r\n\r\n    白骨不懂白爷究竟从哪看到了李旭的潜力，这不就是一个整个和女人厮混的小白脸吗？大街上随随便便都能拉出一群来，而且他知道，白爷很多次来河边钓鱼，都是为了能偶遇李旭，这就更加让他想不明白了。\r\n\r\n    在白爷手下，有很多值得提拔的年轻人，而他们都是有真本事的，为何偏偏就看上了李旭？\r\n\r\n    \u201c你知道，捧着一碗方便面，怕被别人夺了，用力过猛导致面盒变形是什么感觉吗？\u201d\r\n\r\n    \u201c你知道，吃得太快被呛住，可不敢咳出来，硬生生的忍得眼泪直掉，就怕撒了面是什么感觉吗？\u201d\r\n\r\n    白骨不懂，连连摇头，他甚至不知道白爷为什么会说这种话。\r\n\r\n    \u201c我懂。\u201d\r\n\r\n    白爷轻轻一笑，遥想当年，他记忆中那个坐在天桥下的小白，不正是如此吗？\r\n\r\n    李旭的心情很复杂，可以说这辈子都没有过现在的心情。\r\n\r\n    回到家，刘琴竟然在，而且还把家里打扫了一遍。\r\n\r\n    \u201c你什么时候来的。\u201d\r\n\r\n    \u201c你和白爷走了之后，我就来了，不过没敢打扰你，所以没给你说。\u201d\r\n\r\n    刘琴虽然身家上亿，可干起家务活，也是一把好手，家里打扫得干干净净，比李旭叫的保洁效果还要好。\r\n\r\n    \u201c说说看，你怎么会认识白爷的？害得我今天虚惊一场，我还以为白爷要帮陈刚说话呢。\u201d\r\n\r\n    今天还真是个惊心动魄的日子，接到白爷的电话，刘琴一路上都忐忑不安，甚至想过要和陈刚鱼死网破，可到头来，李旭竟然和白爷是朋友，这么大的麻烦，百分之二十的家产就搞定了，这是刘琴做梦都没有想到的。\r\n\r\n    \u201c在今天之前，我也不知道他是白爷，我还以为他就是个退休老头呢。\u201d\r\n\r\n    李旭一直以来，都是把白爷当退休老头来对待的，甚至到现在，老白就是白爷这件事情，李旭还是有点不敢相信。\r\n\r\n    把自己和白爷认识的过程给刘琴说了一遍，刘琴听后满是疑惑，或许，他们的第一次见面是个偶遇，可后来呢？\r\n\r\n    虽然说白爷早就不管江湖事，可他也不会无聊到整天去河边钓鱼吧，他有更多的高级休闲方式才是，而且就凭着这几次偶遇，他就出面帮李旭解决了这么大个麻烦，这不太可能。\r\n\r\n    回到房间里，李旭拿出一个铁盒，铁盒里装着一支已经发黄的烟，这就是当初他向白爷借的，后来没抽，便一直留了下来。\r\n\r\n    \u201c你该不会是打算现在就还白爷烟吧？\u201d\r\n\r\n    看到李旭这样的举动，刘琴赶紧问道，她虽然是个局外人，但是凭借她在商场多大摸爬滚打的经验，她知道，这支烟意味着什么。\r\n\r\n    \u201c姐，你觉得，我应该答应白爷吗？\u201d\r\n\r\n    李旭从来没有遭遇过这种人生巨大转折的选择，所以他根本就不知道自己应该怎么办。\r\n\r\n    \u201c我这么给你说吧，现在除了我之外，没人敢去你的风水店，别看她们平常对你阔绰，可现在出了事，我和陈刚离婚的事情整个汉城都知道了，她们不是我，没有掌控家里的财政大权，还得靠着那些男人养她们，一旦她们和你的事情被发现了，她们只能净身出户，你认为她们会为了你冒这么大的风险吗？\u201d\r\n\r\n    除了刘琴之外，其他的人，本就是一场金钱讨欢心的游戏，李旭没指望那些人在关键时刻还能像刘琴这样。\r\n\r\n    \u201c可你说我这么个小白脸，哪有能耐跟着白爷干啊，他可是黑/社会啊。\u201d\r\n\r\n    \u201c什么黑/社会，汉城没有黑/社会，只有各种各样的圈子，各种各样的人而已，每个圈子都有一个身份地位高的人，只是白爷把整个汉城当作一个圈，而平常的人，只是生活在这个大圈中的小圈而已。\u201d\r\n\r\n    \u201c什么圈圈圆圆，我听不懂，姐，要不，咱还是换个话题吧，今天去饭店的时候，你在门口说那话是什么意思，你给我解释解释啊。\u201d\r\n\r\n    一秒不正经，收好铁盒，李旭就把刘琴抱上了床。\r\n\r\n    \u201c什么话，我怎么不记得我说过什么。\u201d\r\n\r\n    刘琴故意的装着糊涂，不过很快，刘琴便沦陷了，彻底的无法自拔，以至于对着李旭苦苦哀求，把李旭的要求答应了个遍。"}]
     */

    private String code;
    private List<MessageBean> message;

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public List<MessageBean> getMessage() {
        return message;
    }

    public void setMessage(List<MessageBean> message) {
        this.message = message;
    }

    public static class MessageBean {
        /**
         * chapterid : 2642856
         * chapterorder : 7
         * chaptername : 第5章 第五章 心有猛虎待觉醒
         * saleprice : 0
         * size_c : 2982
         * jsfree : 0
         * paytype : 0
         * content :     是否愿意，这不是李旭一时之间能够给出答案的，因为他非常清楚，一旦点头，那么他的生活就会发生翻天覆地的变化，而且这种变化，还带着极高的危险性。

         老白的接/班人！

         以老白在汉城的势力，一旦这件事情被落实，将会有无数双眼睛盯着李旭。

         他们或许会见证李旭的撅起，或许，仅仅是在等待一个笑话而已。

         李旭不敢直面这个问题，所以他需要一些时间来考虑。

         当然，不可否认的是，这的确是一个机会，只可惜，这个机会实在是太大了，大到李旭有些把握不住。

         “跟女人打交道，不光是在床上把她们伺候舒服就行了，得留个心眼，谁也不知道她们什么时候会算计你。”

         一尾小指大小的麻鱼上钩，老白也不嫌弃，直接收入鱼护。

         刘琴会不会害李旭，李旭清楚得很，当然，李旭也承认刘琴的确是个城府很深的女人。

         就拿给陈刚那百分之二十的家产来说，那么大的集团，刘琴不可能拿不出这笔钱，半年百分之五，也就是想控制陈刚而已，让陈刚不敢闹事，不敢给她找麻烦，李旭心知肚明，既然他能够想到，老白这种老/江湖，自然也能够看透。

         “老白，说个实话，你为什么会愿意帮我？以你这样高高在上的人物，怎么可能看得起我这种小角色呢？”

         李旭本身是不愿意直面这个问题的，可是事实就是如此，他不面对也逃避不了，而且还心存疑惑，还不如干脆就寻个答案。

         “我有很多朋友，只可惜，这些朋友都是基于利益关系，我白爷的名号什么时候日落西山了，这些所谓的朋友，便不会再围绕在我身边，还记得我们第一次见面的时候吗？”

         “你一个老男人，我记得这么清干什么？”

         李旭一点印象都没有了，整天和女人打交道，讨她们开心，李旭的脑子都用在想新奇花样上了，哪有容量记住和老白第一次见面。

         白爷一脸苦笑，真是拿李旭一点办法都没有，要是其他人，敢用这种口气跟他说话，早就尸沉汉林河了，可奇怪的是，他倒喜欢李旭用这种语气跟他说话，舒服，自在。

         “那时候，你还在吃泡面，哭，满脸的鼻涕口水，你说你要在这个城市混出个人样，你说要让那些看不起你的人高攀不上，你跟我借了支烟，说你飞黄腾达的时候，要还我一支中华。”

         白爷回忆着往事，脸上露着淡淡的笑意。

         听完这番话之后，李旭惊讶的望着白爷，那一天，他永远都不会忘记，因为他被扫地出门，失去了唯一的工作，没了人生的目标，也正是在那个时候，他认识了刘琴，刘琴给了他重生的机会。

         这支烟，李旭一直记得，但他却忘了，那天给他烟的人，竟然是白爷。

         或许……真是哭得太厉害，以至于他当天根本就没有看清白爷的样子。

         “你需要形容得这么仔细吗？还满脸鼻涕口水，有没有这么夸张。”

         这事是李旭心里的一个烙印，他从来没忘，也从来不敢忘，即便是现在的生活已经好了很多，可那支烟，他没抽，一直放在家里，那就像是一件圣物，时刻的提醒着他当日落寞的情形。

         “我的烟呢？”

         老白抛竿而出，姿势优美，可鱼线直接扔在了杂草上。

         “老白，做人不能这么没良心啊，我每次来这里，看到你可都给了烟的，早还清了吧。”

         “利群怎么能算，当初说好了可是中华啊。”

         两人表面上看着像是为了一支烟较劲，可实际上，两人的心里都清楚，他们是在为了李旭的身份地位而争论。

         那支中华烟，就代表了李旭的身份。

         如果在这个时候，李旭还了一支中华，那么他便不再和白爷有任何交集的可能性，当他满于现状，白爷的存在也就没有任何意义了，而且白爷也不会对他有任何的期望。

         李旭满足了吗？

         并没有，他还需要一些时间，利群只是喜好，而中华，才是目标。

         “老白，你慢慢钓，我还有事，就不陪你了。”

         说完，李旭没等老白回答，直接就走了，他需要一点空间冷静一下，让自己彻头彻尾的想想生活究竟该以什么样的方式继续下去。

         “白爷，你为什么会那么看重这个年轻人？”

         说话的人，是白爷的心腹，在汉城也是个响当当的人物，人称白骨，没有人知道他的真实姓名，传说这是个猛将，当年白爷打天下的时候，他是白爷手下的头号打手，不过这些年已经渐渐收手，所以年轻一代知道他的并不多。

         “心有猛虎待觉醒，是个值得期待的苗子。”

         白骨不懂白爷究竟从哪看到了李旭的潜力，这不就是一个整个和女人厮混的小白脸吗？大街上随随便便都能拉出一群来，而且他知道，白爷很多次来河边钓鱼，都是为了能偶遇李旭，这就更加让他想不明白了。

         在白爷手下，有很多值得提拔的年轻人，而他们都是有真本事的，为何偏偏就看上了李旭？

         “你知道，捧着一碗方便面，怕被别人夺了，用力过猛导致面盒变形是什么感觉吗？”

         “你知道，吃得太快被呛住，可不敢咳出来，硬生生的忍得眼泪直掉，就怕撒了面是什么感觉吗？”

         白骨不懂，连连摇头，他甚至不知道白爷为什么会说这种话。

         “我懂。”

         白爷轻轻一笑，遥想当年，他记忆中那个坐在天桥下的小白，不正是如此吗？

         李旭的心情很复杂，可以说这辈子都没有过现在的心情。

         回到家，刘琴竟然在，而且还把家里打扫了一遍。

         “你什么时候来的。”

         “你和白爷走了之后，我就来了，不过没敢打扰你，所以没给你说。”

         刘琴虽然身家上亿，可干起家务活，也是一把好手，家里打扫得干干净净，比李旭叫的保洁效果还要好。

         “说说看，你怎么会认识白爷的？害得我今天虚惊一场，我还以为白爷要帮陈刚说话呢。”

         今天还真是个惊心动魄的日子，接到白爷的电话，刘琴一路上都忐忑不安，甚至想过要和陈刚鱼死网破，可到头来，李旭竟然和白爷是朋友，这么大的麻烦，百分之二十的家产就搞定了，这是刘琴做梦都没有想到的。

         “在今天之前，我也不知道他是白爷，我还以为他就是个退休老头呢。”

         李旭一直以来，都是把白爷当退休老头来对待的，甚至到现在，老白就是白爷这件事情，李旭还是有点不敢相信。

         把自己和白爷认识的过程给刘琴说了一遍，刘琴听后满是疑惑，或许，他们的第一次见面是个偶遇，可后来呢？

         虽然说白爷早就不管江湖事，可他也不会无聊到整天去河边钓鱼吧，他有更多的高级休闲方式才是，而且就凭着这几次偶遇，他就出面帮李旭解决了这么大个麻烦，这不太可能。

         回到房间里，李旭拿出一个铁盒，铁盒里装着一支已经发黄的烟，这就是当初他向白爷借的，后来没抽，便一直留了下来。

         “你该不会是打算现在就还白爷烟吧？”

         看到李旭这样的举动，刘琴赶紧问道，她虽然是个局外人，但是凭借她在商场多大摸爬滚打的经验，她知道，这支烟意味着什么。

         “姐，你觉得，我应该答应白爷吗？”

         李旭从来没有遭遇过这种人生巨大转折的选择，所以他根本就不知道自己应该怎么办。

         “我这么给你说吧，现在除了我之外，没人敢去你的风水店，别看她们平常对你阔绰，可现在出了事，我和陈刚离婚的事情整个汉城都知道了，她们不是我，没有掌控家里的财政大权，还得靠着那些男人养她们，一旦她们和你的事情被发现了，她们只能净身出户，你认为她们会为了你冒这么大的风险吗？”

         除了刘琴之外，其他的人，本就是一场金钱讨欢心的游戏，李旭没指望那些人在关键时刻还能像刘琴这样。

         “可你说我这么个小白脸，哪有能耐跟着白爷干啊，他可是黑/社会啊。”

         “什么黑/社会，汉城没有黑/社会，只有各种各样的圈子，各种各样的人而已，每个圈子都有一个身份地位高的人，只是白爷把整个汉城当作一个圈，而平常的人，只是生活在这个大圈中的小圈而已。”

         “什么圈圈圆圆，我听不懂，姐，要不，咱还是换个话题吧，今天去饭店的时候，你在门口说那话是什么意思，你给我解释解释啊。”

         一秒不正经，收好铁盒，李旭就把刘琴抱上了床。

         “什么话，我怎么不记得我说过什么。”

         刘琴故意的装着糊涂，不过很快，刘琴便沦陷了，彻底的无法自拔，以至于对着李旭苦苦哀求，把李旭的要求答应了个遍。
         */

        private String chapterid;
        private String chapterorder;
        private String chaptername;
        private String saleprice;
        private String size_c;
        private String jsfree;
        private String paytype;
        private String content;

        public String getChapterid() {
            return chapterid;
        }

        public void setChapterid(String chapterid) {
            this.chapterid = chapterid;
        }

        public String getChapterorder() {
            return chapterorder;
        }

        public void setChapterorder(String chapterorder) {
            this.chapterorder = chapterorder;
        }

        public String getChaptername() {
            return chaptername;
        }

        public void setChaptername(String chaptername) {
            this.chaptername = chaptername;
        }

        public String getSaleprice() {
            return saleprice;
        }

        public void setSaleprice(String saleprice) {
            this.saleprice = saleprice;
        }

        public String getSize_c() {
            return size_c;
        }

        public void setSize_c(String size_c) {
            this.size_c = size_c;
        }

        public String getJsfree() {
            return jsfree;
        }

        public void setJsfree(String jsfree) {
            this.jsfree = jsfree;
        }

        public String getPaytype() {
            return paytype;
        }

        public void setPaytype(String paytype) {
            this.paytype = paytype;
        }

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }
    }
}
